<template>
    <div>
        <main-menu top-button-type="BACK" header-text="竞价说明" />
        <div class="bidding_main">
            <div class="bidding_module">
                <h6 class="b_smtit">购买流程</h6>
                <div class="text">
                    <p v-bind:key="step" v-for="step in steps">{{step}}</p>
                </div>
            </div>   
        </div>
    </div>
    
</template>

<script>
    import mainMenu from '../components/MainMenu.vue'

    export default {
        components: {
            mainMenu
        },
        data(){
            return {
                maps:[
                    {
                        name: '全品',
                        mark: 'XF',
                        description: '品相与发行品相差无几，色泽鲜艳，齿孔整齐，纸张允许有极细小纸点和极轻微软折等细小瑕疵。（背胶是原胶，由于时间原因可自然发黄但必须非常均匀；连张邮票齿孔允许轻微软折，金银粉邮票金银粉保存完好允许局部细小氧化。）'
                    },
                    {
                        name: '上品',
                        mark: 'F-VF',
                        description: '票品整体感觉完美，色泽鲜艳，纸张允许有纸点，轻微软折等。（有轻微发黄、污、拉毛、露白、短齿等，背胶是原胶，允许阴阳黄，胶不匀，胶折；连张邮票齿孔间允许有折痕但没有撕开，不影响到邮票本身，金银粉邮票金银粉允许轻微氧化，邮票允许贴纸；解放前票品允许发黄，部分胶，无胶或后胶。）'
                    },
                    {
                        name: '中上品',
                        mark: 'F',
                        description: '票品整体感觉较好，色泽基本鲜艳，齿孔基本整齐，纸张允许有折痕等。（有发黄，发霉，部分胶，贴片，或无胶，后胶，缺齿，揭薄，裂口，脱色，褪色等；连张邮票可以撕开，金银粉邮票金银粉允许氧化。）'
                    },
                    {
                        name: '中品',
                        mark: 'G',
                        description: '品整体感觉一般，没有严重的外伤及缺陷。（在中上品品级的基础上允许色泽感觉相对陈旧，有相当程度的缺齿、缺角、撕裂、褪色、揭薄、折痕等。）'
                    },
                    {
                        name: '差品',
                        mark: 'P',
                        description: '票品有伤残或严重缺陷。（存在严重缺齿、缺角、撕裂、褪色、揭薄、硬折、破损等，或尺寸规格差异明显。）'
                    },
                    {
                        name: '修补品',
                        mark: 'RD',
                        description: '经过人为修补的票品。（经过人为的修补处理，如补色、刮戳、换底、拼补等）'
                    }
                ],
                pagers: [
                    {
                        mark: 'UNC+',
                        description: '完全未使用。纸币保存极好，状态与发行时无异。票面坚挺无折痕， 没有有任何黄斑脏点和人为修补处理。'
                    },
                    {
                        mark: 'UNC',
                        description: '未使用。状态良好与绝品接近，唯因年代久远或保存不当造成纸张少许的变色或污染；可能有1 ~ 2处极微小的票角轻折或磨圆的现象,允许票面尺寸有1mm左右误差。'
                    },
                    {
                        mark: 'AU+',
                        description: '近未使用。肉眼看起来可能是未流通票，但有 1条轻微的竖折痕或1 ~ 2处的票角轻折和磨圆现象。'
                    },
                    {
                        mark: 'AU',
                        description: '近未使用。肉眼看起来可能是未流通票，允许不超过 2条轻微的竖折痕或1条较明显的竖折痕，且票角有1 ~ 2处轻折或磨圆；可能有人为处理和压平的现象。'
                    },
                    {
                        mark: 'XF+',
                        description: '票品有较明显的流通痕迹。有不超过3条的竖折痕和较明显的票角折痕与磨圆；可能有人为处理和压平的现象。'
                    },
                    {
                        mark: 'XF',
                        description: '票品有较明显的流通痕迹。有不超过3条的竖折痕，并允许其中1条为横折痕或死折，可能有人为处理和压平的现象。'
                    },
                    {
                        mark: 'VF',
                        description: '票品有明显流通的痕迹。票面已污染软垂，并有4 ~ 5条的折痕和边角的小裂口。'
                    },
                    {
                        mark: 'F',
                        description: '票品有长期流通的痕迹。票面有多处折痕，并有较严重的污染、软垂、撕裂、中心孔等问题。'
                    },
                    {
                        mark: 'VG',
                        description: '票品状态与F品相近。但票面图案已褪色和磨损，并可能出现缺角的现象。'
                    },
                    {
                        mark: 'P',
                        description: '票品状态欠佳。票面图案模糊且完全软垂，并出现断裂和整片缺损等严重问题'
                    }
                ],
                steps:[
                    "1. 所有参与拍卖者必须登记为会员",
                    "2. 本APP所有拍卖和商城货品均以人民币结算（外币付款以当时汇率计算）",
                    "3. 买家需付成交价的3%佣金，邮费以拍品标注为准",
                    "4. 我们接受微信支付/内地银行转款/香港银行转款/PAYPAL（额外5%手续费），或香港公司取货",
                    "5. 本APP不论自营或联营货品，均统一由本平台指定的收款账号收款，微信账号yibuysell，支付宝14715763370，中国银行6217582000042262345（陈文彦，深圳南山支行），Paypal Chanmanyinhk@yahoo.com.hk 或香港恒生银行226-0-072653。请不要随便向其他人士转款，我们将不承担任何因此而衍生的责任。",
                    "6. 拍卖结束或商城购物后5天内付款，否则可能会追加额外行政、存储或保险费，超过14日不付款的按弃标论，其账号将被冻结，不允许参与拍卖，直到付钱款项为止",
                    "7. 所有拍卖都有描述或图片，请买家仔细查阅，如有问题可以留言提问，出价无悔，恕不接受无理取消竞价",
                    "8. 本拍卖APP除自营货品外，包括其他加盟商户的货品，均按照国家对消费者保障的规定，并提供3包（包真如假必退，包安全寄达买家手中，包收到货后3日内无理由退货）",
                    "9. 香港联合拍卖有限公司为本APP 之持有人，拥有最终解释权，如有任何疑问可以联系本公司微信号yibuysell"
                ]
            }
        }
    }
</script>

<style>

</style>